#5
alphabet = {'а': 'a', 
            'ә': 'а',
            'б': 'b', 
            'в': 'v', 
            'г': 'g', 
            'ғ': 'g', 
            'д': 'd', 
            'е': 'e', 
            'ё': 'e', 
            'ж': 'j', 
            'з': 'z', 
            'и': 'ı', 
            'й': 'ı', 
            'к': 'k',
            'қ': 'q', 
            'л': 'l', 
            'м': 'm', 
            'н': 'n', 
            'ң': 'n', 
            'о': 'o', 
            'ө': 'o', 
            'п': 'p', 
            'р': 'r', 
            'с': 's', 
            'т': 't', 
            'у': 'y', 
            'ұ': 'u', 
            'ү': 'ú', 
            'ф': 'f', 
            'х': 'h', 
            'һ': 'h', 
            'ц': 'c', 
            'ч': 'ch', 
            'ш': 'sh',
            'щ': 'sh', 
            'ы': 'y', 
            'і': 'i', 
            'э': 'e',
            'ю': 'ıy', 
            'я': 'ıa'}
text = input("Текст енгізіңіз: ")
latin_text = ''
for i in text:
    if i.lower() in alphabet:
        latin_text += alphabet[i.lower()]

print("Латын текст: ", latin_text)



